# 날짜와 시간 다루기

### 문자열을 날짜로 변환하기

In [8]:
import numpy as np
import pandas as pd

date_strings = np.array(['03-04-2005 11:0 PM',
                        '23-05-2010 12:01 AM',
                        '04-09-2009 09:09 PM'])

[pd.to_datetime(date, format = '%d-%m-%Y %I:%M %p') for date in date_strings]

[Timestamp('2005-04-03 23:00:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [3]:
[pd.to_datetime(date, format = '%d-%m-%Y %I:%M %p', errors = 'ignore') for date in date_strings]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [9]:
pd.to_datetime(date_strings)

DatetimeIndex(['2005-03-04 23:00:00', '2010-05-23 00:01:00',
               '2009-04-09 21:09:00'],
              dtype='datetime64[ns]', freq=None)

### 시간대 다루기

In [10]:
import pandas as pd

pd.Timestamp('2017-05-01 06:00:00',tz='Europe/London')

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [11]:
date = pd.Timestamp('2017-05-01 06:00:00')

date_in_london = date.tz_localize('Europe/London')

date_in_london

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [12]:
date_in_london.tz_convert('Africa/Abidjan')

Timestamp('2017-05-01 05:00:00+0000', tz='Africa/Abidjan')

In [15]:
date_in_london.tz_convert('Asia/Seoul')

Timestamp('2017-05-01 14:00:00+0900', tz='Asia/Seoul')

In [16]:
dates = pd.Series(pd.date_range('2/2/2002',periods =3, freq ='M'))

dates.dt.tz_localize('Africa/Abidjan')

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

In [17]:
from pytz import all_timezones

all_timezones[0:2]

['Africa/Abidjan', 'Africa/Accra']

In [18]:
dates.dt.tz_localize('dateutil/Asia/Seoul')

0   2002-02-28 00:00:00+09:00
1   2002-03-31 00:00:00+09:00
2   2002-04-30 00:00:00+09:00
dtype: datetime64[ns, tzfile('ROK')]

### 날짜와 시간 선택하기

In [19]:
import pandas as pd

dataframe = pd.DataFrame()

dataframe['date'] = pd.date_range('1/1/2001',periods = 100000, freq = 'H')

dataframe[(dataframe['date']>'2002-1-1 01:00:00')&(dataframe['date'] <= '2002-1-1 04:00:00')]

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

In [21]:
dataframe = dataframe.set_index(dataframe['date'])

dataframe.loc['2002-1-1 01:00:00':'2002-1-1 04:00:00']

                                   date
date
2002-01-01 01:00:00 2002-01-01 01:00:00
2002-01-01 02:00:00 2002-01-01 02:00:00
2002-01-01 03:00:00 2002-01-01 03:00:00
2002-01-01 04:00:00 2002-01-01 04:00:00

### 날짜 데이터를 여러 특성으로 나누기

In [22]:
import pandas as pd

dataframe = pd.DataFrame()

dataframe['date'] = pd.date_range('1/1/2001',periods = 150, freq = 'W')

dataframe['year'] = dataframe['date'].dt.year
dataframe['month'] = dataframe['date'].dt.month
dataframe['day'] = dataframe['date'].dt.day
dataframe['hour'] = dataframe['date'].dt.hour
dataframe['minute'] = dataframe['date'].dt.minute

In [26]:
dataframe.head(151)

          date  year  month  day  hour  minute
0   2001-01-07  2001      1    7     0       0
1   2001-01-14  2001      1   14     0       0
2   2001-01-21  2001      1   21     0       0
3   2001-01-28  2001      1   28     0       0
4   2001-02-04  2001      2    4     0       0
..         ...   ...    ...  ...   ...     ...
145 2003-10-19  2003     10   19     0       0
146 2003-10-26  2003     10   26     0       0
147 2003-11-02  2003     11    2     0       0
148 2003-11-09  2003     11    9     0       0
149 2003-11-16  2003     11   16     0       0

[150 rows x 6 columns]

### 날짜 간의 차이를 계산하기

In [28]:
import pandas as pd

dataframe = pd.DataFrame()

dataframe['Arrived'] = [pd.Timestamp('01-01-2017'),pd.Timestamp('01-04-2017')]
dataframe['Left'] = [pd.Timestamp('01-01-2017'),pd.Timestamp('01-06-2017')]

dataframe['Left'] - dataframe['Arrived']

0   0 days
1   2 days
dtype: timedelta64[ns]

In [30]:
pd.Series(delta.days for delta in (dataframe['Left'] - dataframe['Arrived']))

0    0
1    2
dtype: int64

### 요일을 인코딩하기

In [37]:
import pandas as pd

dates = pd.Series(pd.date_range("2/2/2002",periods= 3,freq = 'M'))

dates.dt.weekday

0    3
1    6
2    1
dtype: int64

### 시차 특성 만들기

In [39]:
import pandas as pd

dataframe = pd.DataFrame()

dataframe['dates'] = pd.date_range("1/1/2001",periods = 5,freq = "D")
dataframe['stock_price'] = [1.1,2.2,3.3,4.4,5.5]

dataframe["previous_days_stock_price"] = dataframe["stock_price"].shift(1)

dataframe

       dates  stock_price  previous_days_stock_price
0 2001-01-01          1.1                        NaN
1 2001-01-02          2.2                        1.1
2 2001-01-03          3.3                        2.2
3 2001-01-04          4.4                        3.3
4 2001-01-05          5.5                        4.4

### 이동 시간 윈도 사용하기

In [40]:
import pandas as pd

time_index = pd.date_range("01/01/2010",periods =5, freq = 'M')

dataframe=pd.DataFrame(index = time_index)

dataframe['Stock_Price'] = [1,2,3,4,5]

dataframe.rolling(window=2).mean()

            Stock_Price
2010-01-31          NaN
2010-02-28          1.5
2010-03-31          2.5
2010-04-30          3.5
2010-05-31          4.5

In [41]:
dataframe.ewm(alpha = 0.5).mean()

            Stock_Price
2010-01-31     1.000000
2010-02-28     1.666667
2010-03-31     2.428571
2010-04-30     3.266667
2010-05-31     4.161290

### 시계열 데이터에서 누락된 값 다루기

In [43]:
import pandas as pd
import numpy as np

time_index = pd.date_range("01/01/2010",periods = 5,freq = 'M')
dataframe = pd.DataFrame(index = time_index)
dataframe["Sales"] = [1.0,2.0,np.nan,np.nan,5.0]

In [44]:
dataframe.interpolate()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

In [45]:
dataframe.ffill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

In [46]:
dataframe.bfill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

In [48]:
dataframe.interpolate(method = 'quadratic')

               Sales
2010-01-31  1.000000
2010-02-28  2.000000
2010-03-31  3.059808
2010-04-30  4.038069
2010-05-31  5.000000

In [49]:
dataframe.interpolate(limit = 1, limit_direction = 'forward')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0

In [50]:
dataframe.interpolate(limit = 1, limit_direction = 'backward')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    NaN
2010-04-30    4.0
2010-05-31    5.0